emacs-blog/public_html/fedora-18-experience.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Fedora 18 配置记录</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Fedora 18 配置记录"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-23 23:01:56 CST"/>
<meta name="author" content="tuhaihe"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link href="css/org.css" rel="stylesheet" type="text/css">
<link href="css/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="css/bootstrap-responsive.min.css" rel="stylesheet">

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Fedora 18 配置记录</h1>

<p>Fedora 是 Red Hat 赞助的社区发行版本，倡导“FREEDOME, FRIENDS, FEATURES, FIRST”。其最新版本 Fedora 19 预计将在 2013.07.02 发布。
</p>
<p>
下面是 Fedora 18 体验过程中我遇到的问题。下面给出了解决方法，仅供参考。
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">配置</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">触摸板无法实现“点击”功能</h3>
<div class="outline-text-3" id="text-1-1">


<p>
  该问题解决方法与 <a href="http://tuhaihe.com/debian-wheezy-xfce-touchpad.html">Xfce 触摸板启动“点击”(Debian Wheezy)</a> 一文中的解决方法一致。
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Adode flash 播放器</h3>
<div class="outline-text-3" id="text-1-2">


<p>
   因 Adobe Flash 插件不是自由和开源软件，所以无法预装在 Fedora 中。
</p>
<p>
  <b>解决方法<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup></b>
</p>
<ol>
<li>
</li>
</ol>


<p>
  <b>X86_64(64 位)</b>
</p>


<pre class="example">sudo yum install http://linuxdownload.adobe.com/adobe-release/adobe-release-x86_64-1.0-1.noarch.rpm -y
</pre>


<p>
  <b>X86(32 位)</b>
</p>



<pre class="example">sudo yum install http://linuxdownload.adobe.com/adobe-release/adobe-release-i386-1.0-1.noarch.rpm -y
</pre>


<p>
  2.导入 Adobe Flash 插件仓库 GPG 密钥并安装
</p>



<pre class="example">sudo rpm --import /etc/pki/rpm-gpg/RPM-GPG-KEY-adobe-linux
sudo yum install flash-plugin -y
</pre>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">多媒体编码解码器</h3>
<div class="outline-text-3" id="text-1-3">


<p>
  1.下载并安装 Free &amp; Nonfree 仓库
</p>
<p>     
  Free 软件仓库为开源软件仓库，Fedora 项目因为其他原因无法搭载；
  Nonfree 仓库主要存放非开源但可重新分发的软件。
</p>



<pre class="example"># 适用于 Fedora14 到当前最新版本
sudo 'yum localinstall --nogpgcheck http://download1.rpmfusion.org/free/fedora/rpmfusion-free-release-$(rpm -E %fedora).noarch.rpm http://download1.rpmfusion.org/nonfree/fedora/rpmfusion-nonfree-release-$(rpm -E %fedora).noarch.rpm'
</pre>


<p>     
  2.安装多媒体编解码器
</p>



<pre class="example">sudo yum makecach #创建元数据缓存
sudo yum install ffmpeg ffmpeg-libs gstreamer-ffmpeg xvidcore libdvdread libdvdnav lsdvd gstreamer-plugins-good gstreamer-plugins-bad gstreamer-plugins-ugly
</pre>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">更多</h3>
<div class="outline-text-3" id="text-1-4">

<ul>
<li>如果在安装过程中没有将创建的用户添加到管理组，则无法在命令前面使用 sudo。可用下面方法将当前用户添加至管理员组：




<pre class="example">$ su #切换到 root 用户
# echo 'fedora ALL=(ALL) ALL' &gt;&gt; /etc/sudoers #fedora为当前用户名
</pre>

</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">YUM 常用选项</h2>
<div class="outline-text-2" id="text-2">


<p>
  YUM 是基于 RPM 的软件包管理器，可用来更新、升级、安装或卸载软件包。
</p>
<p>
  命令格式： <code>yum [选项] 命令</code>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>可用命令列表</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">可用命令</td><td class="left">功能说明</td><td class="left">apt “类似”命令（不完全对应）</td></tr>
<tr><td class="left">install</td><td class="left">向系统中安装一个或多个软件包</td><td class="left">apt-get install</td></tr>
<tr><td class="left">remove</td><td class="left">从系统中移除一个或多个软件包</td><td class="left">apt-get remove</td></tr>
<tr><td class="left">info</td><td class="left">显示关于软件包或组的详细信息</td><td class="left">apt-cache show</td></tr>
<tr><td class="left">makecache</td><td class="left">创建元数据缓存</td><td class="left">apt-get update</td></tr>
<tr><td class="left">reinstall</td><td class="left">重新安装一个包</td><td class="left">apt-get install pkg &ndash;reinstall</td></tr>
<tr><td class="left">search</td><td class="left">在软件包详细信息中搜索指定字符串</td><td class="left">apt-cache search</td></tr>
<tr><td class="left">update</td><td class="left">更新系统中的一个或多个软件包</td><td class="left">apt-get upgrade</td></tr>
<tr><td class="left">upgrade</td><td class="left">更新软件包同时考虑软件包取代关系</td><td class="left">apt-get dist-upgrade</td></tr>
</tbody>
</table>



<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> <a href="https://fedoraproject.org/wiki/Flash">https://fedoraproject.org/wiki/Flash</a>
</p></div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="postamble">Update time: 2013-05-23 23:01:56 CST.</p> 
</div>
</body>
</html>
